wodecoin/mm32f5270_nano_frame/base/library/MM32F5270/Include/reg_tim.h
/**
  * @brief TIM_CCER Register Bit Definition
  */
#define  TIM_CCER_CC1E_Pos                        (0)
#define  TIM_CCER_CC1E_Msk                        (0x01U << TIM_CCER_CC1E_Pos)  /*!<*/
#define  TIM_CCER_CC1P_Pos                        (1)
#define  TIM_CCER_CC1P_Msk                        (0x01U << TIM_CCER_CC1P_Pos)  /*!<*/
#define  TIM_CCER_CC1NE_Pos                       (2)
#define  TIM_CCER_CC1NE_Msk                       (0x01U << TIM_CCER_CC1NE_Pos) /*!<*/
#define  TIM_CCER_CC1NP_Pos                       (3)
#define  TIM_CCER_CC1NP_Msk                       (0x01U << TIM_CCER_CC1NP_Pos) /*!<*/
#define  TIM_CCER_CC2E_Pos                        (4)
#define  TIM_CCER_CC2E_Msk                        (0x01U << TIM_CCER_CC2E_Pos)  /*!<*/
#define  TIM_CCER_CC2P_Pos                        (5)
#define  TIM_CCER_CC2P_Msk                        (0x01U << TIM_CCER_CC2P_Pos)  /*!<*/
#define  TIM_CCER_CC2NE_Pos                       (6)
#define  TIM_CCER_CC2NE_Msk                       (0x01U << TIM_CCER_CC2NE_Pos) /*!<*/
#define  TIM_CCER_CC2NP_Pos                       (7)
#define  TIM_CCER_CC2NP_Msk                       (0x01U << TIM_CCER_CC2NP_Pos) /*!<*/
#define  TIM_CCER_CC3E_Pos                        (8)
#define  TIM_CCER_CC3E_Msk                        (0x01U << TIM_CCER_CC3E_Pos)  /*!<*/
#define  TIM_CCER_CC3P_Pos                        (9)
#define  TIM_CCER_CC3P_Msk                        (0x01U << TIM_CCER_CC3P_Pos)  /*!<*/
#define  TIM_CCER_CC3NE_Pos                       (10)
#define  TIM_CCER_CC3NE_Msk                       (0x01U << TIM_CCER_CC3NE_Pos) /*!<*/
#define  TIM_CCER_CC3NP_Pos                       (11)
#define  TIM_CCER_CC3NP_Msk                       (0x01U << TIM_CCER_CC3NP_Pos) /*!<*/
#define  TIM_CCER_CC4E_Pos                        (12)
#define  TIM_CCER_CC4E_Msk                        (0x01U << TIM_CCER_CC4E_Pos)  /*!<*/
#define  TIM_CCER_CC4P_Pos                        (13)
#define  TIM_CCER_CC4P_Msk                        (0x01U << TIM_CCER_CC4P_Pos)  /*!<*/
#define  TIM_CCER_CC4NE_Pos                       (14)
#define  TIM_CCER_CC4NE_Msk                       (0x01U << TIM_CCER_CC4NE_Pos) /*!<*/
#define  TIM_CCER_CC4NP_Pos                       (15)
#define  TIM_CCER_CC4NP_Msk                       (0x01U << TIM_CCER_CC4NP_Pos) /*!<*/

/**
  * @brief TIM_CNT Register Bit Definition
  */
#define  TIM_CNT_CNT_Pos                          (0)
#define  TIM_CNT_CNT_Msk                          (0xFFFFFFFFU << TIM_CNT_CNT_Pos) /*!<*/

/**
  * @brief TIM_PSC Register Bit Definition
  */
#define  TIM_PSC_PSC_Pos                          (0)
#define  TIM_PSC_PSC_Msk                          (0xFFFFU << TIM_PSC_PSC_Pos) /*!<*/

/**
  * @brief TIM_ARR Register Bit Definition
  */
#define  TIM_ARR_ARR_Pos                          (0)
#define  TIM_ARR_ARR_Msk                          (0xFFFFFFFFU << TIM_ARR_ARR_Pos) /*!<*/

/**
  * @brief TIM_RCR Register Bit Definition
  */
#define  TIM_RCR_REP_Pos                          (0)
#define  TIM_RCR_REP_Msk                          (0xFFU << TIM_RCR_REP_Pos)     /*!<*/
#define  TIM_RCR_REP_CNT_Pos                      (8)
#define  TIM_RCR_REP_CNT_Msk                      (0xFFU << TIM_RCR_REP_CNT_Pos) /*!<*/

/**
  * @brief TIM_CCR1 Register Bit Definition
  */
#define  TIM_CCR1_CCR1_Pos                        (0)
#define  TIM_CCR1_CCR1_Msk                        (0xFFFFFFFFU << TIM_CCR1_CCR1_Pos) /*!<*/

/**
  * @brief TIM_CCR2 Register Bit Definition
  */
#define  TIM_CCR2_CCR2_Pos                        (0)
#define  TIM_CCR2_CCR2_Msk                        (0xFFFFFFFFU << TIM_CCR2_CCR2_Pos) /*!<*/

/**
  * @brief TIM_CCR3 Register Bit Definition
  */
#define  TIM_CCR3_CCR3_Pos                        (0)
#define  TIM_CCR3_CCR3_Msk                        (0xFFFFFFFFU << TIM_CCR3_CCR3_Pos) /*!<*/

/**
  * @brief TIM_CCR4 Register Bit Definition
  */
#define  TIM_CCR4_CCR4_Pos                        (0)
#define  TIM_CCR4_CCR4_Msk                        (0xFFFFFFFFU << TIM_CCR4_CCR4_Pos) /*!<*/

/**
  * @brief TIM_BDTR Register Bit Definition
  */
#define  TIM_BDTR_DTG_Pos                         (0)
#define  TIM_BDTR_DTG_Msk                         (0xFFU << TIM_BDTR_DTG_Pos)  /*!<*/
#define  TIM_BDTR_LOCK_Pos                        (8)
#define  TIM_BDTR_LOCK_Msk                        (0x03U << TIM_BDTR_LOCK_Pos) /*!<*/
#define  TIM_BDTR_OSSI_Pos                        (10)
#define  TIM_BDTR_OSSI_Msk                        (0x01U << TIM_BDTR_OSSI_Pos) /*!<*/
#define  TIM_BDTR_OSSR_Pos                        (11)
#define  TIM_BDTR_OSSR_Msk                        (0x01U << TIM_BDTR_OSSR_Pos) /*!<*/
#define  TIM_BDTR_BKE_Pos                         (12)
#define  TIM_BDTR_BKE_Msk                         (0x01U << TIM_BDTR_BKE_Pos)  /*!<*/
#define  TIM_BDTR_BKP_Pos                         (13)
#define  TIM_BDTR_BKP_Msk                         (0x01U << TIM_BDTR_BKP_Pos)  /*!<*/
#define  TIM_BDTR_AOE_Pos                         (14)
#define  TIM_BDTR_AOE_Msk                         (0x01U << TIM_BDTR_AOE_Pos)  /*!<*/
#define  TIM_BDTR_MOE_Pos                         (15)
#define  TIM_BDTR_MOE_Msk                         (0x01U << TIM_BDTR_MOE_Pos)  /*!<*/
#define  TIM_BDTR_DOE_Pos                         (16)
#define  TIM_BDTR_DOE_Msk                         (0x01U << TIM_BDTR_DOE_Pos)  /*!<*/

/**
  * @brief TIM_DCR Register Bit Definition
  */
#define  TIM_DCR_DBA_Pos                          (0)
#define  TIM_DCR_DBA_Msk                          (0x1FU << TIM_DCR_DBA_Pos) /*!<*/
#define  TIM_DCR_DBL_Pos                          (8)
#define  TIM_DCR_DBL_Msk                          (0x1FU << TIM_DCR_DBL_Pos) /*!<*/

/**
  * @brief TIM_DMAR Register Bit Definition
  */
#define  TIM_DMAR_DMAB_Pos                        (0)
#define  TIM_DMAR_DMAB_Msk                        (0xFFFFU << TIM_DMAR_DMAB_Pos) /*!<*/

/**
  * @brief TIM_OR Register Bit Definition
  */
#define  TIM_OR_ETR_RMP_Pos                       (0)
#define  TIM_OR_ETR_RMP_Msk                       (0x03U << TIM_OR_ETR_RMP_Pos) /*!<*/
#define  TIM_OR_TI4_RMP_Pos                       (6)
#define  TIM_OR_TI4_RMP_Msk                       (0x03U << TIM_OR_TI4_RMP_Pos) /*!<*/

/**
  * @brief TIM_CCMR3 Register Bit Definition
  */
#define  TIM_CCMR3_OC5PE_Pos                      (3)
#define  TIM_CCMR3_OC5PE_Msk                      (0x01U << TIM_CCMR3_OC5PE_Pos) /*!<*/

/**
  * @brief TIM_CCR5 Register Bit Definition
  */
#define  TIM_CCR5_CCR5_Pos                        (0)
#define  TIM_CCR5_CCR5_Msk                        (0xFFFFU << TIM_CCR5_CCR5_Pos) /*!<*/

/**
  * @brief TIM_PDER Register Bit Definition
  */
#define  TIM_PDER_CCDREPE_Pos                     (0)
#define  TIM_PDER_CCDREPE_Msk                     (0x01U << TIM_PDER_CCDREPE_Pos)       /*!<*/
#define  TIM_PDER_CCR1_SHIFT_EN_Pos               (1)
#define  TIM_PDER_CCR1_SHIFT_EN_Msk               (0x01U << TIM_PDER_CCR1_SHIFT_EN_Pos) /*!<*/
#define  TIM_PDER_CCR2_SHIFT_EN_Pos               (2)
#define  TIM_PDER_CCR2_SHIFT_EN_Msk               (0x01U << TIM_PDER_CCR2_SHIFT_EN_Pos) /*!<*/
#define  TIM_PDER_CCR3_SHIFT_EN_Pos               (3)
#define  TIM_PDER_CCR3_SHIFT_EN_Msk               (0x01U << TIM_PDER_CCR3_SHIFT_EN_Pos) /*!<*/
#define  TIM_PDER_CCR4_SHIFT_EN_Pos               (4)
#define  TIM_PDER_CCR4_SHIFT_EN_Msk               (0x01U << TIM_PDER_CCR4_SHIFT_EN_Pos) /*!<*/
#define  TIM_PDER_CCR5_SHIFT_EN_Pos               (5)
#define  TIM_PDER_CCR5_SHIFT_EN_Msk               (0x01U << TIM_PDER_CCR5_SHIFT_EN_Pos) /*!<*/

/**
  * @brief TIM_CCRFALL Register Bit Definition
  */
#define TIM_CCR1FALL_CCR1FALL                     (0xFFFFU)                             /*!< Capture/compare value for ch1 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR2FALL Register Bit Definition
  */
#define TIM_CCR2FALL_CCR2FALL                     (0xFFFFU)                             /*!< Capture/compare value for ch2 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR3FALL Register Bit Definition
  */
#define TIM_CCR3FALL_CCR3FALL                     (0xFFFFU)                             /*!< Capture/compare value for ch3 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR4FALL Register Bit Definition
  */
#define TIM_CCR4FALL_CCR4FALL                     (0xFFFFU)                             /*!< Capture/compare value for ch4 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_CCR5FALL Register Bit Definition
  */
#define TIM_CCR5FALL_CCR5FALL                     (0xFFFFU)                             /*!< Capture/compare value for ch5 when counting down in PWM center-aligned mode */

/**
  * @brief TIM_BKINF Register Bit Definition
  */
#define  TIM_BKINF_BKINFE_Pos                     (0)
#define  TIM_BKINF_BKINFE_Msk                     (0x01U << TIM_BKINF_BKINFE_Pos)       /*!<*/
#define  TIM_BKINF_BKINF_Pos                      (1)
#define  TIM_BKINF_BKINF_Msk                      (0x0FU << TIM_BKINF_BKINF_Pos)        /*!<*/
#define  TIM_BKINF_CSSBKIN_SEL_Pos                (5)
#define  TIM_BKINF_CSSBKIN_SEL_Msk                (0x01U << TIM_BKINF_CSSBKIN_SEL_Pos)  /*!<*/
#define  TIM_BKINF_IOBKIN_SEL_Pos                 (6)
#define  TIM_BKINF_IOBKIN_SEL_Msk                 (0x0FU << TIM_BKINF_IOBKIN_SEL_Pos)   /*!<*/
#define  TIM_BKINF_COMPBKIN_SEL_Pos               (13)
#define  TIM_BKINF_COMPBKIN_SEL_Msk               (0x07U << TIM_BKINF_COMPBKIN_SEL_Pos) /*!<*/

#endif

